app/controllers/sessions_controller.rb

	def create
		#complete this method
		user = User.find_by(email: params[:session][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "vawohl@miuandes.cl"], ["LIMIT", 1]]